{"format": "graph-model", "generatedBy": "2.1.0-rc1", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"dense_input:0": {"name": "dense_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "dense_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "12544"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12544"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/sub", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12544"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/reshape/strided_slice/stack", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape/shape/1", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape/shape/3", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_1/stack_1", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/mul/y", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_2/stack_1", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/stack/3", "op": "Const", "input": ["^dense_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/mul/y", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/stack/3", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^dense_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "input": ["^dense_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul", "op": "MatMul", "input": ["dense_input", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul", "StatefulPartitionedCall/sequential/dense/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul_1", "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/leaky_re_lu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/batch_normalization/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/leaky_re_lu/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/reshape/Shape", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/reshape/strided_slice", "StatefulPartitionedCall/sequential/reshape/Reshape/shape/1", "StatefulPartitionedCall/sequential/reshape/Reshape/shape/1", "StatefulPartitionedCall/sequential/reshape/Reshape/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential/leaky_re_lu/LeakyRelu", "StatefulPartitionedCall/sequential/reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/reshape/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose/Shape", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose/Shape", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose/Shape", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_1", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_2", "StatefulPartitionedCall/sequential/conv2d_transpose/stack/3", "^StatefulPartitionedCall/sequential/conv2d_transpose/mul/y"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose/stack", "StatefulPartitionedCall/sequential/conv2d_transpose/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential/reshape/Reshape"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential/conv2d_transpose/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/leaky_re_lu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/leaky_re_lu_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_1/Shape", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_1/Shape", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_1/Shape", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_1/mul/y", "StatefulPartitionedCall/sequential/conv2d_transpose_1/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_1/mul/y", "StatefulPartitionedCall/sequential/conv2d_transpose_1/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/sequential/conv2d_transpose_1/mul", "StatefulPartitionedCall/sequential/conv2d_transpose_1/mul_1", "StatefulPartitionedCall/sequential/conv2d_transpose_1/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_1/stack", "StatefulPartitionedCall/sequential/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential/leaky_re_lu_1/LeakyRelu"], "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential/conv2d_transpose_1/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/leaky_re_lu_2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.30000001192092896}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/leaky_re_lu_2/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_2/Shape", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_2/Shape", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_2/Shape", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_1/mul/y", "StatefulPartitionedCall/sequential/conv2d_transpose_2/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_1/mul/y", "StatefulPartitionedCall/sequential/conv2d_transpose_2/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/sequential/conv2d_transpose_2/mul", "StatefulPartitionedCall/sequential/conv2d_transpose_2/mul_1", "StatefulPartitionedCall/sequential/conv2d_transpose/mul/y"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_2/stack", "StatefulPartitionedCall/sequential/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential/leaky_re_lu_2/LeakyRelu"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_2/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/conv2d_transpose_2/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [100, 12544], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul", "shape": [12544], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/sub", "shape": [12544], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/mul/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/mul/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}]}]}